# Необходимо создать (не программно) текстовый файл, где
# каждая строка описывает учебный предмет и наличие лекционных,
# практических и лабораторных занятий по этому предмету и их
# количество. Важно, чтобы для каждого предмета не обязательно
# были все типы занятий. Сформировать словарь, содержащий
# название предмета и общее количество занятий по нему.
# Вывести словарь на экран.
subj = {}
with open('h_w-5-6.txt', 'r', encoding='utf-8') as init_f:
    for line in init_f:
        name, stats = line.split(':')
        name_sum = sum(map(int, "".join([i for i in stats if i == ' ' or '9' > i >= '0']).split()))
        subj[name] = name_sum
        print(f"{subj}")
