# Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.
# У пользователя необходимо запрашивать новый элемент рейтинга.
# Если в рейтинге существуют элементы с одинаковыми значениями,
# то новый элемент с тем же значением должен разместиться после них

rate = [8, 7, 5, 6, 2, 4, 5, 8, 9, 2, 4, 5]
user_number = int(input("Please enter new integer number: "))
i = 0
for n in rate:
    if user_number <= n:
        i += 1
rate.insert(i, user_number)
print(rate)
