# Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента. Использовать функцию type() для проверки типа.
a, b, c, d, e, f = 2, {3: 8, 5: 8}, 7.8, (2, 6), [2, 6], str
my_list = [a, b, c, d, e, f]
for i in my_list:
    print(f"{i} is {type(i)}")