#Программа запрашивает у пользователя строку чисел, разделенных пробелом.
# При нажатии Enter должна выводиться сумма чисел.
# Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter.
# Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме.
# Но если вместо числа вводится специальный символ, выполнение программы завершается.
# Если специальный символ введен после нескольких чисел,
# то вначале нужно добавить сумму этих чисел к полученной ранее сумме и после этого завершить программу
def my_sum():
    sum = 0
    exit = False
    while exit == False:
        number = input('Пожалуйста введите числа через пробел или нажмите Q для выхода из программы - ').split()

        res = 0
        for el in range(len(number)):
            if number[el] == 'q' or number[el] == 'Q':
                exit = True
                break
            else:
                res = res + int(number[el])
        sum = sum + res
        print(f'текущая сумма чисел {sum}')
    print(f'итоговая сумма чисел {sum}')


my_sum()